app/Controllers/Admin/Banner.php

    public function index(): string
    {
        $banners = $this->bannerModel->orderBy('sort_order', 'ASC')->findAll();
---
SELECT *
FROM `banners`
WHERE `banners`.`deleted_at` IS NULL
ORDER BY `sort_order` ASC