app/Helpers/setting_helper.php

SELECT *
FROM `settings`
WHERE `settings`.`deleted_at` IS NULL
---
    function get_setting(string $key, $default = '')
    {
        static $cachedSettings = null;

        if ($cachedSettings === null) {
            $model = new SettingModel();
            $settings = $model->findAll();