app/Controllers/Home.php

    public function index(): string
    {
        $bannerModel = new BannerModel();
        $serviceModel = new ServiceModel();
        $galleryModel = new GalleryModel();
        $newsModel = new NewsModel();
        $partnerModel = new PartnerModel();
        $certificateModel = new CertificateModel();
        $documentCategoryModel = new DocumentCategoryModel();

        $certificateItems = [];
        try {
            $certificateCategory = $documentCategoryModel
                ->where('slug', 'giay-chung-nhan')
                ->where('status', 1)
                ->first();

            if ($certificateCategory) {
                $certificateItems = $certificateModel
                    ->where('category_id', (int) $certificateCategory['id'])
                    ->where('status', 1)
                    ->orderBy('sort_order', 'ASC')
                    ->limit(8)
                    ->findAll();
---
SELECT *
FROM `document_categories`
WHERE `slug` = 'giay-chung-nhan'
AND `status` = 1
AND `document_categories`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `certificates`
WHERE `category_id` = 1
AND `status` = 1
AND `certificates`.`deleted_at` IS NULL
ORDER BY `sort_order` ASC
 LIMIT 8


        $data = [
            'banners'  => $bannerModel->where('status', 1)->orderBy('sort_order', 'ASC')->findAll(),
            'services' => $serviceModel->where('status', 1)->findAll(),
            'gallery'  => $galleryModel->where('status', 1)->orderBy('sort_order', 'ASC')->limit(6)->findAll(),
            'news'     => $newsModel->where('status', 'published')->orderBy('published_at', 'DESC')->limit(3)->findAll(),
            'partners' => $partnerModel->where('status', 1)->orderBy('sort_order', 'ASC')->findAll(),
---
SELECT *
FROM `services`
WHERE `status` = 1
AND `services`.`deleted_at` IS NULL
SELECT *
FROM `gallery`
WHERE `status` = 1
AND `gallery`.`deleted_at` IS NULL
ORDER BY `sort_order` ASC
 LIMIT 6
SELECT *
FROM `news`
WHERE `status` = 'published'
AND `news`.`deleted_at` IS NULL
ORDER BY `published_at` DESC
 LIMIT 3
SELECT *
FROM `partners`
WHERE `status` = 1
AND `partners`.`deleted_at` IS NULL
ORDER BY `sort_order` ASC