app/Controllers/Home.php

SELECT *
FROM `services`
WHERE `status` = 1
AND `services`.`deleted_at` IS NULL
SELECT *
FROM `gallery`
WHERE `status` = 1
AND `gallery`.`deleted_at` IS NULL
ORDER BY `sort_order` ASC
 LIMIT 6
SELECT *
FROM `news`
WHERE `status` = 'published'
AND `news`.`deleted_at` IS NULL
ORDER BY `published_at` DESC
 LIMIT 3
SELECT *
FROM `partners`
WHERE `status` = 1
AND `partners`.`deleted_at` IS NULL
ORDER BY `sort_order` ASC
---
    public function index(): string
    {
        $bannerModel = new BannerModel();
        $serviceModel = new ServiceModel();
        $galleryModel = new GalleryModel();
        $newsModel = new NewsModel();
        $partnerModel = new PartnerModel();

        $data = [
            'banners'  => $bannerModel->where('status', 1)->orderBy('sort_order', 'ASC')->findAll(),
            'services' => $serviceModel->where('status', 1)->findAll(),
            'gallery'  => $galleryModel->where('status', 1)->orderBy('sort_order', 'ASC')->limit(6)->findAll(),
            'news'     => $newsModel->where('status', 'published')->orderBy('published_at', 'DESC')->limit(3)->findAll(),
            'partners' => $partnerModel->where('status', 1)->orderBy('sort_order', 'ASC')->findAll(),