app/Controllers/Service.php

SELECT *
FROM `services`
WHERE `slug` = 'dich-vu-luu-tru-ngan-ngay'
AND `status` = 1
AND `services`.`deleted_at` IS NULL
 LIMIT 1
---
    public function show(string $slug): string
    {
        $service = $this->serviceModel->where('slug', $slug)
                                      ->where('status', 1)
                                      ->first();