app/Views/layouts/header.php

                    <!-- Dịch Vụ Dropdown -->
                    <?php
                    $navServiceModel = new \App\Models\ServiceModel();
                    $navServices = $navServiceModel->where('status', 1)->findAll();
---
SELECT *
FROM `services`
WHERE `status` = 1
AND `services`.`deleted_at` IS NULL

                    <!-- Tin Tức Dropdown -->
                    <?php
                    $navCatModel = new \App\Models\NewsCategoryModel();
                    $navCategories = $navCatModel->findAll();
---
SELECT *
FROM `news_categories`
WHERE `news_categories`.`deleted_at` IS NULL

                    $navDocCategories = [];
                    try {
                        $navDocCatModel = new \App\Models\DocumentCategoryModel();
                        $navDocCategories = $navDocCatModel->where('status', 1)->orderBy('sort_order', 'ASC')->findAll();
---
SELECT *
FROM `document_categories`
WHERE `status` = 1
AND `document_categories`.`deleted_at` IS NULL
ORDER BY `sort_order` ASC